#### Terraform Format and Style 🖌`success`
#### shared-services Terraform Initialization ⚙️`success`
#### shared-services Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### shared-services Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mmodule.container_registry.module.container_registry.random_string.base: Refreshing state... [id=o5lu][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.random_string.base: Refreshing state... [id=Rvwc][0m
[0m[1mmodule.key_vault.module.key_vault.random_string.base: Refreshing state... [id=tPY6][0m
[0m[1mmodule.key_vault.module.key_vault_access_policy.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.network_transit_hub.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus][0m
[0m[1mmodule.container_registry.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-container-registry-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus][0m
[0m[1mmodule.boot_diag_storage.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.key_vault.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-shared-services-eastus/providers/Microsoft.Storage/storageAccounts/stdiagshrvwceastus][0m
[0m[1mmodule.windows_jumpbox.module.network_security_group.azurerm_network_security_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services][0m
[0m[1mmodule.domain_controllers.module.managed_disk.azurerm_managed_disk.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-1-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.managed_disk.azurerm_managed_disk.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-0-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.public_ip_fw.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-fw-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.virtual_network.azurerm_virtual_network.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.public_ip_vgw.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-vgw-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_security_group.azurerm_network_security_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services][0m
[0m[1mmodule.container_registry.module.container_registry.azurerm_container_registry.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-container-registry-shared-services-eastus/providers/Microsoft.ContainerRegistry/registries/acrsho5lueastus][0m
[0m[1mmodule.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services/securityRules/Allow RDP][0m
[0m[1mmodule.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services/securityRules/Deny RDP][0m
[0m[1mmodule.network_transit_hub.module.firewall.azurerm_subnet.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/AzureFirewallSubnet][0m
[0m[1mmodule.network_transit_hub.module.virtual_network_gateway.azurerm_subnet.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/GatewaySubnet][0m
[0m[1mmodule.windows_jumpbox.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[13]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DCOM, RPC, EPM][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[14]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DFSN, NetLogon, NetBIOS Datagram Service][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[4]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Kerberos][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[8]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, EPM][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[17]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DFSN, NetBIOS Session Service, NetLogon][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[11]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Windows Time][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[3]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP GC SSL][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[15]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SOAP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[16]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/NetLogon, NetBIOS Name Resolution][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[12]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Kerberos change and set password][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[2]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP GC][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[5]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DNS][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[9]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, DCOM, EPM, DRSUAPI, NetLogonR, SamR, FRS][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[10]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, DFSR (SYSVOL)][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP SSL][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[6]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SMB,CIFS,SMB2, DFSN, LSARPC, NbtSS, NetLogonR, SamR, SrvSvc][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[7]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SMTP][0m
[0m[1mmodule.network_transit_hub.module.firewall.azurerm_firewall.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/azureFirewalls/azfw-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.virtual_network_gateway.azurerm_virtual_network_gateway.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworkGateways/vgw-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault.azurerm_key_vault.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus/providers/Microsoft.KeyVault/vaults/kvshtpy6eastus][0m
[0m[1mmodule.windows_jumpbox.module.network_interface.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-jumpbox-0-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_interface.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-1-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_interface.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-0-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault_access_policy.azurerm_key_vault_access_policy.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus/providers/Microsoft.KeyVault/vaults/kvshtpy6eastus/objectId/e7e9c92f-4927-48e5-9042-263c2e65ba36][0m
[0m[1mmodule.windows_jumpbox.module.virtual_machine.azurerm_windows_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-jumpbox-0-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-1-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-0-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-0-shared-services-eastus/dataDisks/datadisk-wvm-dc-0-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-1-shared-services-eastus/dataDisks/datadisk-wvm-dc-1-shared-services-eastus][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # module.domain_controllers.module.managed_disk.azurerm_managed_disk.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_managed_disk" "base" {
        [1m[0mcreate_option[0m[0m        = "Empty"
      [33m~[0m [0m[1m[0mdisk_iops_read_write[0m[0m = 500 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdisk_mbps_read_write[0m[0m = 60 [33m->[0m [0m(known after apply)
        [1m[0mdisk_size_gb[0m[0m         = 60
      [33m~[0m [0m[1m[0mid[0m[0m                   = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-0-shared-services-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m             = "eastus"
      [33m~[0m [0m[1m[0mname[0m[0m                 = "datadisk-wvm-dc-0-shared-services-eastus" [33m->[0m [0m"datadisk-wvm-dc-00-shared-services-eastus" [31m# forces replacement[0m[0m
        [1m[0mresource_group_name[0m[0m  = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_uri[0m[0m           = (known after apply)
        [1m[0mstorage_account_type[0m[0m = "Standard_LRS"
        [1m[0mtags[0m[0m                 = {
            "terraform_managed" = "true"
        }
        [1m[0mzones[0m[0m                = [
            "1",
        ]
    }

[1m  # module.domain_controllers.module.managed_disk.azurerm_managed_disk.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_managed_disk" "base" {
        [1m[0mcreate_option[0m[0m        = "Empty"
      [33m~[0m [0m[1m[0mdisk_iops_read_write[0m[0m = 500 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdisk_mbps_read_write[0m[0m = 60 [33m->[0m [0m(known after apply)
        [1m[0mdisk_size_gb[0m[0m         = 60
      [33m~[0m [0m[1m[0mid[0m[0m                   = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-1-shared-services-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m             = "eastus"
      [33m~[0m [0m[1m[0mname[0m[0m                 = "datadisk-wvm-dc-1-shared-services-eastus" [33m->[0m [0m"datadisk-wvm-dc-01-shared-services-eastus" [31m# forces replacement[0m[0m
        [1m[0mresource_group_name[0m[0m  = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_uri[0m[0m           = (known after apply)
        [1m[0mstorage_account_type[0m[0m = "Standard_LRS"
        [1m[0mtags[0m[0m                 = {
            "terraform_managed" = "true"
        }
        [1m[0mzones[0m[0m                = [
            "2",
        ]
    }

[1m  # module.domain_controllers.module.network_interface.azurerm_network_interface.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface" "base" {
      [33m~[0m [0m[1m[0mapplied_dns_servers[0m[0m           = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdns_servers[0m[0m                   = [] [33m->[0m [0m(known after apply)
        [1m[0menable_accelerated_networking[0m[0m = false
        [1m[0menable_ip_forwarding[0m[0m          = false
      [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-0-shared-services-eastus" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [33m~[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = "tfpzpf30ri1edp44a2myhun2ic.bx.internal.cloudapp.net" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                      = "eastus"
      [33m~[0m [0m[1m[0mmac_address[0m[0m                   = "00-0D-3A-99-9C-CF" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                          = "nic-wvm-dc-0-shared-services-eastus" [33m->[0m [0m"nic-wvm-dc-00-shared-services-eastus" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.0.12.10" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = [
          [31m-[0m [0m"10.0.12.10",
        ] [33m->[0m [0m(known after apply)
        [1m[0mresource_group_name[0m[0m           = "rg-active-directory-shared-services-eastus"
      [31m-[0m [0m[1m[0mtags[0m[0m                          = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-0-shared-services-eastus" [33m->[0m [0m(known after apply)

      [33m~[0m [0mip_configuration {
          [33m~[0m [0m[1m[0mname[0m[0m                          = "ip-nic-wvm-dc-0-shared-services-eastus" [33m->[0m [0m"ip-nic-wvm-dc-00-shared-services-eastus"
          [33m~[0m [0m[1m[0mprimary[0m[0m                       = true [33m->[0m [0m(known after apply)
            [1m[0mprivate_ip_address[0m[0m            = "10.0.12.10"
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Static" [33m->[0m [0m"static"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus"
        }
    }

[1m  # module.domain_controllers.module.network_interface.azurerm_network_interface.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface" "base" {
      [33m~[0m [0m[1m[0mapplied_dns_servers[0m[0m           = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdns_servers[0m[0m                   = [] [33m->[0m [0m(known after apply)
        [1m[0menable_accelerated_networking[0m[0m = false
        [1m[0menable_ip_forwarding[0m[0m          = false
      [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-1-shared-services-eastus" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [33m~[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = "tfpzpf30ri1edp44a2myhun2ic.bx.internal.cloudapp.net" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                      = "eastus"
      [33m~[0m [0m[1m[0mmac_address[0m[0m                   = "00-0D-3A-99-9B-24" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                          = "nic-wvm-dc-1-shared-services-eastus" [33m->[0m [0m"nic-wvm-dc-01-shared-services-eastus" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.0.12.11" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = [
          [31m-[0m [0m"10.0.12.11",
        ] [33m->[0m [0m(known after apply)
        [1m[0mresource_group_name[0m[0m           = "rg-active-directory-shared-services-eastus"
      [31m-[0m [0m[1m[0mtags[0m[0m                          = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-1-shared-services-eastus" [33m->[0m [0m(known after apply)

      [33m~[0m [0mip_configuration {
          [33m~[0m [0m[1m[0mname[0m[0m                          = "ip-nic-wvm-dc-1-shared-services-eastus" [33m->[0m [0m"ip-nic-wvm-dc-01-shared-services-eastus"
          [33m~[0m [0m[1m[0mprimary[0m[0m                       = true [33m->[0m [0m(known after apply)
            [1m[0mprivate_ip_address[0m[0m            = "10.0.12.11"
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Static" [33m->[0m [0m"static"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus"
        }
    }

[1m  # module.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_windows_virtual_machine" "base" {
        [1m[0madmin_password[0m[0m             = (sensitive value)
        [1m[0madmin_username[0m[0m             = "kuhlmanlabs"
        [1m[0mallow_extension_operations[0m[0m = true
      [33m~[0m [0m[1m[0mcomputer_name[0m[0m              = "dc-0-shea" [33m->[0m [0m"dc-00-shea" [31m# forces replacement[0m[0m
        [1m[0menable_automatic_updates[0m[0m   = true
      [33m~[0m [0m[1m[0mid[0m[0m                         = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-0-shared-services-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                   = "eastus"
        [1m[0mmax_bid_price[0m[0m              = -1
      [33m~[0m [0m[1m[0mname[0m[0m                       = "wvm-dc-0-shared-services-eastus" [33m->[0m [0m"wvm-dc-00-shared-services-eastus" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mnetwork_interface_ids[0m[0m      = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-0-shared-services-eastus",
        ] [33m->[0m [0m(known after apply)
        [1m[0mpriority[0m[0m                   = "Regular"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m         = "10.0.12.10" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m       = [
          [31m-[0m [0m"10.0.12.10",
        ] [33m->[0m [0m(known after apply)
        [1m[0mprovision_vm_agent[0m[0m         = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m          = (known after apply)
      [33m~[0m [0m[1m[0mpublic_ip_addresses[0m[0m        = [] [33m->[0m [0m(known after apply)
        [1m[0mresource_group_name[0m[0m        = "rg-active-directory-shared-services-eastus"
        [1m[0msize[0m[0m                       = "Standard_B2s"
        [1m[0mtags[0m[0m                       = {
            "terraform_managed" = "true"
        }
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m         = "bb239c79-6f50-4cfb-90ec-e36cbb7ff37c" [33m->[0m [0m(known after apply)
        [1m[0mzone[0m[0m                       = "1"

        boot_diagnostics {
            [1m[0mstorage_account_uri[0m[0m = "https://stdiagshrvwceastus.blob.core.windows.net/"
        }

      [33m~[0m [0mos_disk {
            [1m[0mcaching[0m[0m                   = "None"
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m              = 127 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mname[0m[0m                      = "osdisk-wvm-dc-0-shared-services-eastus" [33m->[0m [0m"osdisk-wvm-dc-00-shared-services-eastus" [31m# forces replacement[0m[0m
            [1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
            [1m[0mwrite_accelerator_enabled[0m[0m = false
        }

        source_image_reference {
            [1m[0moffer[0m[0m     = "WindowsServer"
            [1m[0mpublisher[0m[0m = "MicrosoftWindowsServer"
            [1m[0msku[0m[0m       = "2019-Datacenter"
            [1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_windows_virtual_machine" "base" {
        [1m[0madmin_password[0m[0m             = (sensitive value)
        [1m[0madmin_username[0m[0m             = "kuhlmanlabs"
        [1m[0mallow_extension_operations[0m[0m = true
      [33m~[0m [0m[1m[0mcomputer_name[0m[0m              = "dc-1-shea" [33m->[0m [0m"dc-01-shea" [31m# forces replacement[0m[0m
        [1m[0menable_automatic_updates[0m[0m   = true
      [33m~[0m [0m[1m[0mid[0m[0m                         = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-1-shared-services-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                   = "eastus"
        [1m[0mmax_bid_price[0m[0m              = -1
      [33m~[0m [0m[1m[0mname[0m[0m                       = "wvm-dc-1-shared-services-eastus" [33m->[0m [0m"wvm-dc-01-shared-services-eastus" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mnetwork_interface_ids[0m[0m      = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-1-shared-services-eastus",
        ] [33m->[0m [0m(known after apply)
        [1m[0mpriority[0m[0m                   = "Regular"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m         = "10.0.12.11" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m       = [
          [31m-[0m [0m"10.0.12.11",
        ] [33m->[0m [0m(known after apply)
        [1m[0mprovision_vm_agent[0m[0m         = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m          = (known after apply)
      [33m~[0m [0m[1m[0mpublic_ip_addresses[0m[0m        = [] [33m->[0m [0m(known after apply)
        [1m[0mresource_group_name[0m[0m        = "rg-active-directory-shared-services-eastus"
        [1m[0msize[0m[0m                       = "Standard_B2s"
        [1m[0mtags[0m[0m                       = {
            "terraform_managed" = "true"
        }
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m         = "89261c7d-76f6-460f-9000-9acf79652857" [33m->[0m [0m(known after apply)
        [1m[0mzone[0m[0m                       = "2"

        boot_diagnostics {
            [1m[0mstorage_account_uri[0m[0m = "https://stdiagshrvwceastus.blob.core.windows.net/"
        }

      [33m~[0m [0mos_disk {
            [1m[0mcaching[0m[0m                   = "None"
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m              = 127 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mname[0m[0m                      = "osdisk-wvm-dc-1-shared-services-eastus" [33m->[0m [0m"osdisk-wvm-dc-01-shared-services-eastus" [31m# forces replacement[0m[0m
            [1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
            [1m[0mwrite_accelerator_enabled[0m[0m = false
        }

        source_image_reference {
            [1m[0moffer[0m[0m     = "WindowsServer"
            [1m[0mpublisher[0m[0m = "MicrosoftWindowsServer"
            [1m[0msku[0m[0m       = "2019-Datacenter"
            [1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_virtual_machine_data_disk_attachment" "base" {
        [1m[0mcaching[0m[0m                   = "None"
        [1m[0mcreate_option[0m[0m             = "Attach"
      [33m~[0m [0m[1m[0mid[0m[0m                        = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-0-shared-services-eastus/dataDisks/datadisk-wvm-dc-0-shared-services-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlun[0m[0m                       = 0
      [33m~[0m [0m[1m[0mmanaged_disk_id[0m[0m           = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-0-shared-services-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m        = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-0-shared-services-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [1m[0mwrite_accelerator_enabled[0m[0m = false
    }

[1m  # module.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[1][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_virtual_machine_data_disk_attachment" "base" {
        [1m[0mcaching[0m[0m                   = "None"
        [1m[0mcreate_option[0m[0m             = "Attach"
      [33m~[0m [0m[1m[0mid[0m[0m                        = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-1-shared-services-eastus/dataDisks/datadisk-wvm-dc-1-shared-services-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlun[0m[0m                       = 0
      [33m~[0m [0m[1m[0mmanaged_disk_id[0m[0m           = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-1-shared-services-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m        = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-1-shared-services-eastus" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [1m[0mwrite_accelerator_enabled[0m[0m = false
    }

[1m  # module.network_transit_hub.module.virtual_network_gateway.azurerm_virtual_network_gateway.base[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "azurerm_virtual_network_gateway" "base" {
        [1m[0mactive_active[0m[0m       = false
        [1m[0menable_bgp[0m[0m          = false
        [1m[0mgeneration[0m[0m          = "Generation1"
        [1m[0mid[0m[0m                  = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworkGateways/vgw-shared-services-eastus"
        [1m[0mlocation[0m[0m            = "eastus"
        [1m[0mname[0m[0m                = "vgw-shared-services-eastus"
        [1m[0mresource_group_name[0m[0m = "rg-network-transit-hub-shared-services-eastus"
        [1m[0msku[0m[0m                 = "Basic"
        [1m[0mtags[0m[0m                = {
            "terraform_managed" = "true"
        }
        [1m[0mtype[0m[0m                = "Vpn"
        [1m[0mvpn_type[0m[0m            = "RouteBased"

        bgp_settings {
            [1m[0masn[0m[0m             = 65515
            [1m[0mpeer_weight[0m[0m     = 0
            [1m[0mpeering_address[0m[0m = "10.0.10.30"
        }

        ip_configuration {
            [1m[0mname[0m[0m                          = "pip-vgw-shared-services-eastus"
            [1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic"
            [1m[0mpublic_ip_address_id[0m[0m          = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-vgw-shared-services-eastus"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/GatewaySubnet"
        }

      [33m~[0m [0mvpn_client_configuration {
            [1m[0maddress_space[0m[0m        = [
                "192.168.100.0/24",
            ]
            [1m[0mvpn_client_protocols[0m[0m = [
                "SSTP",
            ]

          [32m+[0m [0mroot_certificate {
              [32m+[0m [0m[1m[0mname[0m[0m             = "P2SRootCert"
              [32m+[0m [0m[1m[0mpublic_cert_data[0m[0m = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4VENDQWRtZ0F3SUJBZ0lRSFExcGgwWUM4TGxFcTdpc29SV0ltekFOQmdrcWhraUc5dzBCQVFzRkFEQWIKTVJrd0Z3WURWUVFEREJCQmVuVnlaVkF5VTFKdmIzUkRaWEowTUI0WERUSXdNRFV3TXpBeU1qVTBNRm9YRFRJeApNRFV3TXpBeU5EVTBNRm93R3pFWk1CY0dBMVVFQXd3UVFYcDFjbVZRTWxOU2IyOTBRMlZ5ZERDQ0FTSXdEUVlKCktvWklodmNOQVFFQkJRQURnZ0VQQURDQ0FRb0NnZ0VCQUxrdmVWdHozdWorNEUyUDMrU2xiYzNSejVlUWdnNm8KYmtWd05hdEx6Vkg4aWZnWnlXek1KQzJHNTV3NEZvbGJiMUVvc2FNNGhVMWpEVElyUGJ2RDU3NmQ2a3FzN1RDWQp4R1U5RFZqZ243M01xdWtoRTJkSTgrRzNWbFowcldKN2tzUERZZEJKSi9oQ1BUcU14bGlqSWYzY2ZJbWhOT1B4CnM2YUdoUlpJYVk0QVZRZ2JVZXJjWjdHb0puOXd0dkJsL2VMY0hISEZHV1VCZnJJS3A2Wk1LVnVFamRDR2w4V0YKK29LMytBakpCMkNjbzdBVnZWMjlSR3VGeWF0TkFpdUhYSjc3VkQ2alJPWlFGR25IVmZ6L3pNa1RicHFlY1p3UwpGOE9yUVg4Z3VhRmJobzloejAwSXVyWXA4TVFvbXNQaE14bUdtcEdHNmc5cDR6eE1EVklMOFNrQ0F3RUFBYU14Ck1DOHdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1CMEdBMVVkRGdRV0JCU3NwaTZnNVNPaWl3b2hWd2NHcWp1RUJ2UWgKRkRBTkJna3Foa2lHOXcwQkFRc0ZBQU9DQVFFQUF3UCtMNy9GL2xLQ1BzZWhVYXdjQ0ZYUWk5dTRCRDJzWTJuZgpNVDFFL0ZNRGN1RjZsREJLRHJLZ3NkclNVRjA5Qmxrc2puNmUvdWxFL0NyZHpjYjVvOFlQOWhtNmtvYy80dTdyCk1seWhKYWErV29qR1dsQXNxMmczWWd6ZTFhVXdaVkhvQ0hLSG8vL1Z3anJ0Ynd2bGczYmF4N3d4SGt0dnhIc0YKU0pMalExL2FlSkZUTXkwaEFPeGoySWtVSVNxeFJFNElaVmluNGVZTHJSZWdGVU8zS1BGTjNjS3F2YlNwTmJIdgoxQkcrRjNxUThrc2RuaDhjU2N3V1pYM0l2U2FvRnVCRm84OUVGNWNqNkxRQlBmdXJBZXk4aFdkekJpSHVxc0VDCm8zU3FQK1hrYlhsNWp0cXJpYUVVRS9IU2gvWUFSYnpkTkxINi9RVmJSdTN3K0tEOEtnPT0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            }
          [31m-[0m [0mroot_certificate {
              [31m-[0m [0m[1m[0mname[0m[0m             = "P2SRootCert" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mpublic_cert_data[0m[0m = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tDQpNSUlDOFRDQ0FkbWdBd0lCQWdJUUhRMXBoMFlDOExsRXE3aXNvUldJbXpBTkJna3Foa2lHOXcwQkFRc0ZBREFiDQpNUmt3RndZRFZRUUREQkJCZW5WeVpWQXlVMUp2YjNSRFpYSjBNQjRYRFRJd01EVXdNekF5TWpVME1Gb1hEVEl4DQpNRFV3TXpBeU5EVTBNRm93R3pFWk1CY0dBMVVFQXd3UVFYcDFjbVZRTWxOU2IyOTBRMlZ5ZERDQ0FTSXdEUVlKDQpLb1pJaHZjTkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFMa3ZlVnR6M3VqKzRFMlAzK1NsYmMzUno1ZVFnZzZvDQpia1Z3TmF0THpWSDhpZmdaeVd6TUpDMkc1NXc0Rm9sYmIxRW9zYU00aFUxakRUSXJQYnZENTc2ZDZrcXM3VENZDQp4R1U5RFZqZ243M01xdWtoRTJkSTgrRzNWbFowcldKN2tzUERZZEJKSi9oQ1BUcU14bGlqSWYzY2ZJbWhOT1B4DQpzNmFHaFJaSWFZNEFWUWdiVWVyY1o3R29Kbjl3dHZCbC9lTGNISEhGR1dVQmZySUtwNlpNS1Z1RWpkQ0dsOFdGDQorb0szK0FqSkIyQ2NvN0FWdlYyOVJHdUZ5YXROQWl1SFhKNzdWRDZqUk9aUUZHbkhWZnovek1rVGJwcWVjWndTDQpGOE9yUVg4Z3VhRmJobzloejAwSXVyWXA4TVFvbXNQaE14bUdtcEdHNmc5cDR6eE1EVklMOFNrQ0F3RUFBYU14DQpNQzh3RGdZRFZSMFBBUUgvQkFRREFnSUVNQjBHQTFVZERnUVdCQlNzcGk2ZzVTT2lpd29oVndjR3FqdUVCdlFoDQpGREFOQmdrcWhraUc5dzBCQVFzRkFBT0NBUUVBQXdQK0w3L0YvbEtDUHNlaFVhd2NDRlhRaTl1NEJEMnNZMm5mDQpNVDFFL0ZNRGN1RjZsREJLRHJLZ3NkclNVRjA5Qmxrc2puNmUvdWxFL0NyZHpjYjVvOFlQOWhtNmtvYy80dTdyDQpNbHloSmFhK1dvakdXbEFzcTJnM1lnemUxYVV3WlZIb0NIS0hvLy9Wd2pydGJ3dmxnM2JheDd3eEhrdHZ4SHNGDQpTSkxqUTEvYWVKRlRNeTBoQU94ajJJa1VJU3F4UkU0SVpWaW40ZVlMclJlZ0ZVTzNLUEZOM2NLcXZiU3BOYkh2DQoxQkcrRjNxUThrc2RuaDhjU2N3V1pYM0l2U2FvRnVCRm84OUVGNWNqNkxRQlBmdXJBZXk4aFdkekJpSHVxc0VDDQpvM1NxUCtYa2JYbDVqdHFyaWFFVUUvSFNoL1lBUmJ6ZE5MSDYvUVZiUnUzdytLRDhLZz09DQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tDQo=" [90m->[0m [0m[90mnull[0m[0m
            }
        }
    }

[1m  # module.windows_jumpbox.module.network_interface.azurerm_network_interface.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_interface" "base" {
      [33m~[0m [0m[1m[0mapplied_dns_servers[0m[0m           = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdns_servers[0m[0m                   = [] [33m->[0m [0m(known after apply)
        [1m[0menable_accelerated_networking[0m[0m = false
        [1m[0menable_ip_forwarding[0m[0m          = false
      [33m~[0m [0m[1m[0mid[0m[0m                            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-jumpbox-0-shared-services-eastus" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [33m~[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = "tfpzpf30ri1edp44a2myhun2ic.bx.internal.cloudapp.net" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                      = "eastus"
      [33m~[0m [0m[1m[0mmac_address[0m[0m                   = "00-0D-3A-99-90-1C" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                          = "nic-wvm-jumpbox-0-shared-services-eastus" [33m->[0m [0m"nic-wvm-jumpbox-00-shared-services-eastus" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.0.13.4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = [
          [31m-[0m [0m"10.0.13.4",
        ] [33m->[0m [0m(known after apply)
        [1m[0mresource_group_name[0m[0m           = "rg-jumpbox-shared-services-eastus"
      [31m-[0m [0m[1m[0mtags[0m[0m                          = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m            = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-jumpbox-0-shared-services-eastus" [33m->[0m [0m(known after apply)

      [33m~[0m [0mip_configuration {
          [33m~[0m [0m[1m[0mname[0m[0m                          = "ip-nic-wvm-jumpbox-0-shared-services-eastus" [33m->[0m [0m"ip-nic-wvm-jumpbox-00-shared-services-eastus"
          [33m~[0m [0m[1m[0mprimary[0m[0m                       = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.0.13.4" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic" [33m->[0m [0m"dynamic"
            [1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
            [1m[0msubnet_id[0m[0m                     = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus"
        }
    }

[1m  # module.windows_jumpbox.module.virtual_machine.azurerm_windows_virtual_machine.base[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_windows_virtual_machine" "base" {
        [1m[0madmin_password[0m[0m             = (sensitive value)
        [1m[0madmin_username[0m[0m             = "kuhlmanlabs"
        [1m[0mallow_extension_operations[0m[0m = true
      [33m~[0m [0m[1m[0mcomputer_name[0m[0m              = "jumpbox-0-shea" [33m->[0m [0m"jumpbox-00-shea" [31m# forces replacement[0m[0m
        [1m[0menable_automatic_updates[0m[0m   = true
      [33m~[0m [0m[1m[0mid[0m[0m                         = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-jumpbox-0-shared-services-eastus" [33m->[0m [0m(known after apply)
        [1m[0mlocation[0m[0m                   = "eastus"
        [1m[0mmax_bid_price[0m[0m              = -1
      [33m~[0m [0m[1m[0mname[0m[0m                       = "wvm-jumpbox-0-shared-services-eastus" [33m->[0m [0m"wvm-jumpbox-00-shared-services-eastus" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mnetwork_interface_ids[0m[0m      = [
          [31m-[0m [0m"/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-jumpbox-0-shared-services-eastus",
        ] [33m->[0m [0m(known after apply)
        [1m[0mpriority[0m[0m                   = "Regular"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m         = "10.0.13.4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip_addresses[0m[0m       = [
          [31m-[0m [0m"10.0.13.4",
        ] [33m->[0m [0m(known after apply)
        [1m[0mprovision_vm_agent[0m[0m         = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m          = (known after apply)
      [33m~[0m [0m[1m[0mpublic_ip_addresses[0m[0m        = [] [33m->[0m [0m(known after apply)
        [1m[0mresource_group_name[0m[0m        = "rg-jumpbox-shared-services-eastus"
        [1m[0msize[0m[0m                       = "Standard_B2s"
        [1m[0mtags[0m[0m                       = {
            "terraform_managed" = "true"
        }
      [33m~[0m [0m[1m[0mvirtual_machine_id[0m[0m         = "5ed58beb-132e-4368-8cab-67aabe9146fc" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                       = (known after apply)

        boot_diagnostics {
            [1m[0mstorage_account_uri[0m[0m = "https://stdiagshrvwceastus.blob.core.windows.net/"
        }

      [33m~[0m [0mos_disk {
            [1m[0mcaching[0m[0m                   = "None"
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m              = 127 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mname[0m[0m                      = "osdisk-wvm-jumpbox-0-shared-services-eastus" [33m->[0m [0m"osdisk-wvm-jumpbox-00-shared-services-eastus" [31m# forces replacement[0m[0m
            [1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
            [1m[0mwrite_accelerator_enabled[0m[0m = false
        }

        source_image_reference {
            [1m[0moffer[0m[0m     = "WindowsServer"
            [1m[0mpublisher[0m[0m = "MicrosoftWindowsServer"
            [1m[0msku[0m[0m       = "2019-Datacenter"
            [1m[0mversion[0m[0m   = "latest"
        }
    }

[0m[1mPlan:[0m 10 to add, 1 to change, 10 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./shared-servicestfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./shared-servicestfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*